# YOLOv13-CBAM 改进架构 (用于工业缺陷检测)

nc: 6 # 针对 NEU-DET 数据集改为 6 类 (原为 80)
scales: 
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, DSC3k2,  [512, False, 0.25]] # 4
  - [-1, 1, DSConv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, DSConv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

head:
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [ 9, 1, DownsampleConv, []] # 11
  - [[6, 9], 1, FullPAD_Tunnel, []]  # 12     
  - [[4, 10], 1, FullPAD_Tunnel, []]  # 13    
  - [[8, 11], 1, FullPAD_Tunnel, []] # 14 
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 12], 1, Concat, [1]] # 16 cat backbone P4
  - [-1, 2, DSC3k2, [512, True]] # 17
  - [[-1, 9], 1, FullPAD_Tunnel, []]  # 18

  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [[-1, 13], 1, Concat, [1]] # 20 cat backbone P3
  - [-1, 2, DSC3k2, [256, True]] # 21
  - [10, 1, Conv, [256, 1, 1]] # 22
  - [[21, 22], 1, FullPAD_Tunnel, []]  # 23 (小目标检测基准层)
  
  - [-1, 1, Conv, [256, 3, 2]] # 24
  - [[-1, 18], 1, Concat, [1]] # 25 cat head P4
  - [-1, 2, DSC3k2, [512, True]] # 26
  - [[-1, 9], 1, FullPAD_Tunnel, []]  # 27 (中目标检测基准层)

  - [26, 1, Conv, [512, 3, 2]] # 28
  - [[-1, 14], 1, Concat, [1]] # 29 cat head P5
  - [-1, 2, DSC3k2, [1024,True]] # 30 
  - [[-1, 11], 1, FullPAD_Tunnel, []]  # 31 (大目标检测基准层)
  
  # ================== 核心创新点：引入 CBAM 注意力机制 ==================
  # 分别对 P3(小缺陷), P4(中缺陷), P5(大缺陷) 特征图进行通道和空间双重感知增强
  - [23, 1, CBAM, [256]]  # 32: 提纯微小裂纹 (crazing) 等精细特征
  - [27, 1, CBAM, [512]]  # 33: 提纯中等尺度缺陷特征
  - [31, 1, CBAM, [1024]] # 34: 提纯大面积斑块 (patches) 等深层语义特征

  # ================== 探测头 ==================
  # 将经过注意力机制过滤后的干净特征图送入最终的检测头
  - [[32, 33, 34], 1, Detect, [nc]] # 35: Detect(P3_CBAM, P4_CBAM, P5_CBAM)